; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_12 ?v12 ?v7)
             (pred_11 ?v2 ?v5)
             (pred_1 ?v12 ?v5)
             (pred_2 ?v11 ?v12 )
	     (pred_6 ?v12)
             (pred_5 ?v4)
             (pred_7 ?v2)
             (pred_8 ?v5)
             (pred_4 ?v12)
             (pred_10 ?v2)
             (pred_9 ?v12)
             (pred_3 ))



(:action op_4
:parameters (?v9 ?v13 ?v1 ?v3)
:precondition (and (pred_5 ?v9) (pred_5 ?v13) (pred_7 ?v1) (pred_8 ?v3)
          (pred_12 ?v9 ?v13) (pred_11 ?v1 ?v3)
                   (pred_1 ?v13 ?v3) (pred_6 ?v9) 
                   (pred_4 ?v13) (pred_10 ?v1))
:effect (and  (pred_9 ?v13) (not (pred_4 ?v13))))


(:action op_2
:parameters (?v9 ?v6)
:precondition (and (pred_5 ?v9) (pred_5 ?v6)
               (pred_6 ?v9) (pred_12 ?v9 ?v6) (pred_9 ?v6))
:effect (and (pred_6 ?v6) (not (pred_6 ?v9))))

(:action op_3
:parameters (?v9 ?v1)
:precondition (and (pred_5 ?v9) (pred_7 ?v1) 
                  (pred_6 ?v9) (pred_2 ?v1 ?v9) (pred_3 ))
:effect (and (pred_10 ?v1)
   (not (pred_2 ?v1 ?v9)) (not (pred_3 ))))


(:action op_1
:parameters (?v9 ?v8 ?v10)
:precondition (and (pred_5 ?v9) (pred_7 ?v8) (pred_7 ?v10)
                  (pred_6 ?v9) (pred_10 ?v10) (pred_2 ?v8 ?v9))
:effect (and (pred_10 ?v8) (pred_2 ?v10 ?v9)
        (not (pred_10 ?v10)) (not (pred_2 ?v8 ?v9))))

(:action op_5
:parameters (?v9 ?v1)
:precondition (and (pred_5 ?v9) (pred_7 ?v1) 
                  (pred_6 ?v9) (pred_10 ?v1))
:effect (and (pred_3 ) (pred_2 ?v1 ?v9) (not (pred_10 ?v1)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_04 obj_03 obj_08 obj_29 obj_17 obj_06 obj_28 obj_13 obj_22 obj_01 obj_25 obj_26 obj_24 obj_05 obj_02 obj_30 obj_18 obj_11 obj_19 obj_27 obj_21 obj_10 obj_15 obj_09 obj_14
    obj_07 obj_12
    obj_20 obj_16 obj_23
    )

    (:init
       (pred_3)

       (pred_5 obj_04)
       (pred_5 obj_03)
       (pred_5 obj_08)
       (pred_5 obj_29)
       (pred_5 obj_17)
       (pred_5 obj_06)
       (pred_5 obj_28)
       (pred_5 obj_13)
       (pred_5 obj_22)
       (pred_5 obj_01)
       (pred_5 obj_25)
       (pred_5 obj_26)
       (pred_5 obj_24)
       (pred_5 obj_05)
       (pred_5 obj_02)
       (pred_5 obj_30)
       (pred_5 obj_18)
       (pred_5 obj_11)
       (pred_5 obj_19)
       (pred_5 obj_27)
       (pred_5 obj_21)
       (pred_5 obj_10)
       (pred_5 obj_15)
       (pred_5 obj_09)
       (pred_5 obj_14)
       (pred_8 obj_07)
       (pred_8 obj_12)
       (pred_7 obj_20)
       (pred_7 obj_16)
       (pred_7 obj_23)

       (pred_12 obj_04 obj_06)
       (pred_12 obj_04 obj_03)
       (pred_12 obj_03 obj_28)
       (pred_12 obj_03 obj_08)
       (pred_12 obj_03 obj_04)
       (pred_12 obj_08 obj_13)
       (pred_12 obj_08 obj_29)
       (pred_12 obj_08 obj_03)
       (pred_12 obj_29 obj_22)
       (pred_12 obj_29 obj_17)
       (pred_12 obj_29 obj_08)
       (pred_12 obj_17 obj_01)
       (pred_12 obj_17 obj_29)
       (pred_12 obj_06 obj_25)
       (pred_12 obj_06 obj_28)
       (pred_12 obj_06 obj_04)
       (pred_12 obj_28 obj_26)
       (pred_12 obj_28 obj_13)
       (pred_12 obj_28 obj_03)
       (pred_12 obj_28 obj_06)
       (pred_12 obj_13 obj_24)
       (pred_12 obj_13 obj_22)
       (pred_12 obj_13 obj_08)
       (pred_12 obj_13 obj_28)
       (pred_12 obj_22 obj_05)
       (pred_12 obj_22 obj_01)
       (pred_12 obj_22 obj_29)
       (pred_12 obj_22 obj_13)
       (pred_12 obj_01 obj_02)
       (pred_12 obj_01 obj_17)
       (pred_12 obj_01 obj_22)
       (pred_12 obj_25 obj_30)
       (pred_12 obj_25 obj_26)
       (pred_12 obj_25 obj_06)
       (pred_12 obj_26 obj_18)
       (pred_12 obj_26 obj_24)
       (pred_12 obj_26 obj_28)
       (pred_12 obj_26 obj_25)
       (pred_12 obj_24 obj_11)
       (pred_12 obj_24 obj_05)
       (pred_12 obj_24 obj_13)
       (pred_12 obj_24 obj_26)
       (pred_12 obj_05 obj_19)
       (pred_12 obj_05 obj_02)
       (pred_12 obj_05 obj_22)
       (pred_12 obj_05 obj_24)
       (pred_12 obj_02 obj_27)
       (pred_12 obj_02 obj_01)
       (pred_12 obj_02 obj_05)
       (pred_12 obj_30 obj_21)
       (pred_12 obj_30 obj_18)
       (pred_12 obj_30 obj_25)
       (pred_12 obj_18 obj_10)
       (pred_12 obj_18 obj_11)
       (pred_12 obj_18 obj_26)
       (pred_12 obj_18 obj_30)
       (pred_12 obj_11 obj_15)
       (pred_12 obj_11 obj_19)
       (pred_12 obj_11 obj_24)
       (pred_12 obj_11 obj_18)
       (pred_12 obj_19 obj_09)
       (pred_12 obj_19 obj_27)
       (pred_12 obj_19 obj_05)
       (pred_12 obj_19 obj_11)
       (pred_12 obj_27 obj_14)
       (pred_12 obj_27 obj_02)
       (pred_12 obj_27 obj_19)
       (pred_12 obj_21 obj_10)
       (pred_12 obj_21 obj_30)
       (pred_12 obj_10 obj_15)
       (pred_12 obj_10 obj_18)
       (pred_12 obj_10 obj_21)
       (pred_12 obj_15 obj_09)
       (pred_12 obj_15 obj_11)
       (pred_12 obj_15 obj_10)
       (pred_12 obj_09 obj_14)
       (pred_12 obj_09 obj_19)
       (pred_12 obj_09 obj_15)
       (pred_12 obj_14 obj_27)
       (pred_12 obj_14 obj_09)
       (pred_4 obj_24)
       (pred_4 obj_03)
       (pred_4 obj_08)
       (pred_1  obj_24 obj_07)
       (pred_1  obj_03 obj_12)
       (pred_1  obj_08 obj_07)
       (pred_9 obj_04)
       (pred_9 obj_29)
       (pred_9 obj_17)
       (pred_9 obj_06)
       (pred_9 obj_28)
       (pred_9 obj_13)
       (pred_9 obj_22)
       (pred_9 obj_01)
       (pred_9 obj_25)
       (pred_9 obj_26)
       (pred_9 obj_05)
       (pred_9 obj_02)
       (pred_9 obj_30)
       (pred_9 obj_18)
       (pred_9 obj_11)
       (pred_9 obj_19)
       (pred_9 obj_27)
       (pred_9 obj_21)
       (pred_9 obj_10)
       (pred_9 obj_15)
       (pred_9 obj_09)
       (pred_9 obj_14)

       (pred_11  obj_20 obj_07)
       (pred_11  obj_16 obj_12)
       (pred_11  obj_23 obj_07)
       (pred_2 obj_20 obj_09)
       (pred_2 obj_16 obj_15)
       (pred_2 obj_23 obj_15)
       (pred_6 obj_17)
    )

    (:goal (and
       (pred_2 obj_20 obj_14)
       (pred_2 obj_16 obj_10)
       (pred_2 obj_23 obj_29)
    ))
(:constraints
  (always (not (pred_6 obj_18)))
)
)

; plan
1. (op_2 obj_17 obj_29)
   deleted: (pred_6 obj_17)
   added: (pred_6 obj_29)
   goals met: 0 of 3
2. (op_2 obj_29 obj_22)
   deleted: (pred_6 obj_29)
   added: (pred_6 obj_22)
   goals met: 0 of 3
3. (op_2 obj_22 obj_05)
   deleted: (pred_6 obj_22)
   added: (pred_6 obj_05)
   goals met: 0 of 3
4. (op_2 obj_05 obj_19)
   deleted: (pred_6 obj_05)
   added: (pred_6 obj_19)
   goals met: 0 of 3
5. (op_2 obj_19 obj_09)
   deleted: (pred_6 obj_19)
   added: (pred_6 obj_09)
   goals met: 0 of 3
6. (op_3 obj_09 obj_20)
   deleted: (pred_2 obj_20 obj_09) (pred_3)
   added: (pred_10 obj_20)
   goals met: 0 of 3
7. (op_2 obj_09 obj_14)
   deleted: (pred_6 obj_09)
   added: (pred_6 obj_14)
   goals met: 0 of 3
8. (op_5 obj_14 obj_20)
   deleted: (pred_10 obj_20)
   added: (pred_3) (pred_2 obj_20 obj_14)
   goals met: 1 of 3
9. (op_2 obj_14 obj_09)
   deleted: (pred_6 obj_14)
   added: (pred_6 obj_09)
   goals met: 1 of 3
10. (op_2 obj_09 obj_15)
   deleted: (pred_6 obj_09)
   added: (pred_6 obj_15)
   goals met: 1 of 3
11. (op_3 obj_15 obj_16)
   deleted: (pred_2 obj_16 obj_15) (pred_3)
   added: (pred_10 obj_16)
   goals met: 1 of 3
12. (op_2 obj_15 obj_10)
   deleted: (pred_6 obj_15)
   added: (pred_6 obj_10)
   goals met: 1 of 3
13. (op_5 obj_10 obj_16)
   deleted: (pred_10 obj_16)
   added: (pred_3) (pred_2 obj_16 obj_10)
   goals met: 2 of 3
14. (op_2 obj_10 obj_15)
   deleted: (pred_6 obj_10)
   added: (pred_6 obj_15)
   goals met: 2 of 3
15. (op_3 obj_15 obj_23)
   deleted: (pred_2 obj_23 obj_15) (pred_3)
   added: (pred_10 obj_23)
   goals met: 2 of 3
16. (op_2 obj_15 obj_11)
   deleted: (pred_6 obj_15)
   added: (pred_6 obj_11)
   goals met: 2 of 3
17. (op_2 obj_11 obj_19)
   deleted: (pred_6 obj_11)
   added: (pred_6 obj_19)
   goals met: 2 of 3
18. (op_2 obj_19 obj_05)
   deleted: (pred_6 obj_19)
   added: (pred_6 obj_05)
   goals met: 2 of 3
19. (op_2 obj_05 obj_22)
   deleted: (pred_6 obj_05)
   added: (pred_6 obj_22)
   goals met: 2 of 3
20. (op_2 obj_22 obj_29)
   deleted: (pred_6 obj_22)
   added: (pred_6 obj_29)
   goals met: 2 of 3
21. (op_5 obj_29 obj_23)
   deleted: (pred_10 obj_23)
   added: (pred_3) (pred_2 obj_23 obj_29)
   goals met: 3 of 3
